/** 湖川・海域関連の地物コード
 * - `321`: 湖、沼、池、浦等
 * - `322`: 河川、用水等
 * - `323`: 沢、瀬、淵、瀞、谷、峡、雪渓、河原、州、滝、浜、崎、半島、尻、島等
 * - `341`: 海、湾、灘、淵、浦、瀬、海峡、瀬戸等
 * - `342`: 海岸、浜、半島
 * - `343`: 岬、鼻、崎、磯、敷等
 * - `344`: 海、灘
 * - `345`: 湾、淵、浦、瀬、海峡、瀬戸等、水道
 * - `347`: 海岸、浜、洲、干潟
 * - `348`: 海山、海嶺、海盆等
 * - `353`: はえ、岩礁等
 * - `820`: 湖沼
 * - `822`: 滝
 * - `840`: 海峡、水道
 * - `841`: 湾、灘
 * - `842`: 海岸、浜、磯
 * - `843`: 岬、崎、鼻
 */
export type AnnoCodeGreen =
  | 321
  | 322
  | 323
  | 341
  | 342
  | 343
  | 344
  | 345
  | 347
  | 348
  | 353
  | 820
  | 822
  | 840
  | 841
  | 842
  | 843;
export const annoCodeGreen = [
  321, 322, 323, 341, 342, 343, 344, 345, 347, 348, 353, 820, 822, 840, 841,
  842, 843,
];
