/** 建物・施設などの地物コード
 * - `441`: 空港名
 * - `6371`: 空港
 * - `6373`: 自衛隊等の飛行場
 * - `6375`: 国際空港
 * - `6376`: 主要な空港
 * - `6376`: 国際空港以外の拠点空港等
 * - `661`: 神社
 * - `3231`: 神社 通常の神社
 * - `662`: 寺院
 * - `3232`: 寺院 通常の寺院
 * - `651`: 水族館・動植物園
 * - `673`: 文教施設
 * - `889`: 博物館
 * - `3216`: 博物館法の登録博物館・博物館相当施設
 * - `3217`: 図書館
 * - `533`: 漁港
 * - `6361`: 港湾
 * - `6362`: 漁港
 * - `6367`: 特定重要港
 * - `6368`: 主要な港
 * - `6368`: 重要港
 * - `883`: 警察
 * - `3211`: 交番
 * - `3241`: 警察署
 * - `631`: 大学・大学院
 * - `632`: 短期大学
 * - `633`: 高等専門学校
 * - `634`: 特殊学校
 * - `885`: 学校
 * - `3212`: 学校 高等学校・中等教育学校
 * - `3213`: 学校 中学校
 * - `3214`: 学校 小学校 
 * - `882`: 保健所
 * - `886`: 病院
 * - `3243`: 病院
 * - `3244`: 保健所
 * - `884`: 消防
 * - `3242`: 消防署
 * - `3261`: 工場
 * - `6342`: 城跡 
 * - `653`: 発電所
 * - `8103`: 発電所等
 * - `681`: その他の主要・著名な建物
 * - `532`: 史跡名勝天然記念物
 * - `671`: 商業施設
 * - `831`: 温泉、泉、噴気口
 * - `6331`: 温泉
 * - `6341`: 史跡・名勝・天然記念物
 * - `890`: 老人ホーム
 * - `3215`: 老人ホーム
 * - `611`: 合同庁舎
 * - `612`: 国の機関（合同庁舎、矯正施設及び自衛隊を除く）
 * - `621`: 都道府県庁、北海道の総合振興局・振興局、支庁
 * - `880`: 国の機関
 * - `881`: 地方の機関
 * - `888`: 指定公共機関
 * - `3201`: 官公署
 * - `3202`: 裁判所
 * - `3203`: 税務署
 * - `3204`: 外国公館 
 * - `3205`: 市役所・東京都の区役所
 * - `3206`: 町村役場・政令指定都市の区役所
 * - `887`: 郵便局
 * - `3218`: 郵便局

 * - `613`: 矯正施設（刑務所、少年院等）
 * - `615`: 自衛隊・米軍
 * - `6381`: 自衛隊
 * 
 * - `6301`: 墓地
 * 
 * - `720`: 鉱山の鉱種名
 * - `4104`: 記念碑
 * - `4105`: 自然災害伝承碑
 * - `6332`: 噴火口・噴気口
 
 * - `511`: 構造物名称（高塔、煙突等）
 * - `522`: 堰
 * - `523`: 河川・海岸施設（水門、堤防）
 * - `531`: 土地利用名（演習場、ゴルフ場、遊園地、建設予定地等）

 * - `899`: その他 
 * - `3221`: 灯台
 * - `4101`: 煙突 
 * - `4102`: 風車
 * - `4103`: 油井・ガス井
 * - `6351`: 採鉱地
 * - `8105`: 電波塔
 */
